Repository: humblefoundation-zz/translation-support-files
Catalog: quran-imported/Yusuf Ali.tmx
Source language: ar
Languages: en

source: قال بصرت بما لم يبصروا به فقبضت قبضة من أثر الرسول فنبذتها وكذلك سولت لي نفسي
en: He replied: "I saw what they saw not: so I took a handful (of dust) from the footprint of the Messenger, and threw it (into the calf): thus did my soul suggest to me."

source: قال فاذهب فإن لك في الحياة أن تقول لا مساس وإن لك موعدا لن تخلفه وانظر إلى إلهك الذي ظلت عليه عاكفا لنحرقنه ثم لننسفنه في اليم نسفا
en: (Moses) said: "Get thee gone! but thy (punishment) in this life will be that thou wilt say, 'touch me not'; and moreover (for a future penalty) thou hast a promise that will not fail: Now look at thy god, of whom thou hast become a devoted worshipper: We will certainly (melt) it in a blazing fire and scatter it broadcast in the sea!"

source: إنما إلهكم الله الذي لا إله إلا هو وسع كل شيء علما
en: But the god of you all is the One Allah: there is no god but He: all things He comprehends in His knowledge.

source: كذلك نقص عليك من أنباء ما قد سبق وقد آتيناك من لدنا ذكرا
en: Thus do We relate to thee some stories of what happened before: for We have sent thee a Message from Our own Presence.

source: من أعرض عنه فإنه يحمل يوم القيامة وزرا
en: If any do turn away therefrom, verily they will bear a burden on the Day of judgment;

source: خالدين فيه وساء لهم يوم القيامة حملا
en: They will abide in this (state): and grievous will the burden be to them on that Day,-

source: يوم ينفخ في الصور ونحشر المجرمين يومئذ زرقا
en: The Day when the Trumpet will be sounded: that Day, We shall gather the sinful, blear-eyed (with terror).

source: يتخافتون بينهم إن لبثتم إلا عشرا
en: In whispers will they consult each other: "Yet tarried not longer than ten (Days);

source: نحن أعلم بما يقولون إذ يقول أمثلهم طريقة إن لبثتم إلا يوما
en: We know best what they will say, when their leader most eminent in conduct will say: "Ye tarried not longer than a day!"

source: ويسألونك عن الجبال فقل ينسفها ربي نسفا
en: They ask thee concerning the Mountains: say, "My Lord will uproot them and scatter them as dust;

source: فيذرها قاعا صفصفا
en: "He will leave them as plains smooth and level;

source: لا ترى فيها عوجا ولا أمتا
en: "Nothing crooked or curved wilt thou see in their place."

source: يومئذ يتبعون الداعي لا عوج له وخشعت الأصوات للرحمن فلا تسمع إلا همسا
en: On that Day will they follow the Caller (straight): no crookedness (can they show) him: all sounds shall humble themselves in the Presence of (Allah) Most Gracious: nothing shalt thou hear but the tramp of their feet (as they march).

source: يومئذ لا تنفع الشفاعة إلا من أذن له الرحمن ورضي له قولا
en: On that Day shall no intercession avail except for those for whom permission has been granted by (Allah) Most Gracious and whose word is acceptable to Him.

source: يعلم ما بين أيديهم وما خلفهم ولا يحيطون به علما
en: He knows what (appears to His creatures as) before or after or behind them: but they shall not compass it with their knowledge.

source: وعنت الوجوه للحي القيوم وقد خاب من حمل ظلما
en: (All) faces shall be humbled before (Him) - the Living, the Self-Subsisting, Eternal: hopeless indeed will be the man that carries iniquity (on his back).

source: ومن يعمل من الصالحات وهو مؤمن فلا يخاف ظلما ولا هضما
en: But he who works deeds of righteousness, and has faith, will have no fear of harm nor of any curtailment (of what is his due).

source: وكذلك أنزلناه قرآنا عربيا وصرفنا فيه من الوعيد لعلهم يتقون أو يحدث لهم ذكرا
en: Thus have We sent this down - an arabic Qur'an - and explained therein in detail some of the warnings, in order that they may fear Allah, or that it may cause their remembrance (of Him).

source: فتعالى الله الملك الحق ولا تعجل بالقرآن من قبل أن يقضى إليك وحيه وقل رب زدني علما
en: High above all is Allah, the King, the Truth! Be not in haste with the Qur'an before its revelation to thee is completed, but say, "O my Lord! advance me in knowledge."

source: ولقد عهدنا إلى آدم من قبل فنسي ولم نجد له عزما
en: We had already, beforehand, taken the covenant of Adam, but he forgot: and We found on his part no firm resolve.

source: وإذ قلنا للملائكة اسجدوا لآدم فسجدوا إلا إبليس أبى
en: When We said to the angels, "Prostrate yourselves to Adam", they prostrated themselves, but not Iblis: he refused.

source: فقلنا يا آدم إن هذا عدو لك ولزوجك فلا يخرجنكما من الجنة فتشقى
en: Then We said: "O Adam! verily, this is an enemy to thee and thy wife: so let him not get you both out of the Garden, so that thou art landed in misery.

source: إن لك ألا تجوع فيها ولا تعرى
en: "There is therein (enough provision) for thee not to go hungry nor to go naked,

source: وأنك لا تظمأ فيها ولا تضحى
en: "Nor to suffer from thirst, nor from the sun's heat."

source: فوسوس إليه الشيطان قال يا آدم هل أدلك على شجرة الخلد وملك لا يبلى
en: But Satan whispered evil to him: he said, "O Adam! shall I lead thee to the Tree of Eternity and to a kingdom that never decays?"

source: فأكلا منها فبدت لهما سوآتهما وطفقا يخصفان عليهما من ورق الجنة وعصى آدم ربه فغوى
en: In the result, they both ate of the tree, and so their nakedness appeared to them: they began to sew together, for their covering, leaves from the Garden: thus did Adam disobey his Lord, and allow himself to be seduced.

source: ثم اجتباه ربه فتاب عليه وهدى
en: But his Lord chose him (for His Grace): He turned to him, and gave him Guidance.

source: قال اهبطا منها جميعا بعضكم لبعض عدو فإما يأتينكم مني هدى فمن اتبع هداي فلا يضل ولا يشقى
en: He said: "Get ye down, both of you,- all together, from the Garden, with enmity one to another: but if, as is sure, there comes to you Guidance from Me, whosoever follows My Guidance, will not lose his way, nor fall into misery.

source: ومن أعرض عن ذكري فإن له معيشة ضنكا ونحشره يوم القيامة أعمى
en: "But whosoever turns away from My Message, verily for him is a life narrowed down, and We shall raise him up blind on the Day of Judgment."

source: قال رب لم حشرتني أعمى وقد كنت بصيرا
en: He will say: "O my Lord! why hast Thou raised me up blind, while I had sight (before)?"

source: قال كذلك أتتك آياتنا فنسيتها وكذلك اليوم تنسى
en: (Allah) will say: "Thus didst Thou, when Our Signs came unto thee, disregard them: so wilt thou, this day, be disregarded."

source: وكذلك نجزي من أسرف ولم يؤمن بآيات ربه ولعذاب الآخرة أشد وأبقى
en: And thus do We recompense him who transgresses beyond bounds and believes not in the Signs of his Lord: and the Penalty of the Hereafter is far more grievous and more enduring.

source: أفلم يهد لهم كم أهلكنا قبلهم من القرون يمشون في مساكنهم إن في ذلك لآيات لأولي النهى
en: Is it not a warning to such men (to call to mind) how many generations before them We destroyed, in whose haunts they (now) move? Verily, in this are Signs for men endued with understanding.

source: ولولا كلمة سبقت من ربك لكان لزاما وأجل مسمى
en: Had it not been for a Word that went forth before from thy Lord, (their punishment) must necessarily have come; but there is a Term appointed (for respite).

source: فاصبر على ما يقولون وسبح بحمد ربك قبل طلوع الشمس وقبل غروبها ومن آناء الليل فسبح وأطراف النهار لعلك ترضى
en: Therefore be patient with what they say, and celebrate (constantly) the praises of thy Lord, before the rising of the sun, and before its setting; yea, celebrate them for part of the hours of the night, and at the sides of the day: that thou mayest have (spiritual) joy.

source: ولا تمدن عينيك إلى ما متعنا به أزواجا منهم زهرة الحياة الدنيا لنفتنهم فيه ورزق ربك خير وأبقى
en: Nor strain thine eyes in longing for the things We have given for enjoyment to parties of them, the splendour of the life of this world, through which We test them: but the provision of thy Lord is better and more enduring.

source: وأمر أهلك بالصلاة واصطبر عليها لا نسألك رزقا نحن نرزقك والعاقبة للتقوى
en: Enjoin prayer on thy people, and be constant therein. We ask thee not to provide sustenance: We provide it for thee. But the (fruit of) the Hereafter is for righteousness.

source: وقالوا لولا يأتينا بآية من ربه أولم تأتهم بينة ما في الصحف الأولى
en: They say: "Why does he not bring us a sign from his Lord?" Has not a Clear Sign come to them of all that was in the former Books of revelation?

source: ولو أنا أهلكناهم بعذاب من قبله لقالوا ربنا لولا أرسلت إلينا رسولا فنتبع آياتك من قبل أن نذل ونخزى
en: And if We had inflicted on them a penalty before this, they would have said: "Our Lord! If only Thou hadst sent us a messenger, we should certainly have followed Thy Signs before we were humbled and put to shame."

source: قل كل متربص فتربصوا فستعلمون من أصحاب الصراط السوي ومن اهتدى
en: Say: "Each one (of us) is waiting: wait ye, therefore, and soon shall ye know who it is that is on the straight and even way, and who it is that has received Guidance."

source: اقترب للناس حسابهم وهم في غفلة معرضون
en: Closer and closer to mankind comes their Reckoning: yet they heed not and they turn away.

source: ما يأتيهم من ذكر من ربهم محدث إلا استمعوه وهم يلعبون
en: Never comes (aught) to them of a renewed Message from their Lord, but they listen to it as in jest,-

source: لاهية قلوبهم وأسروا النجوى الذين ظلموا هل هذا إلا بشر مثلكم أفتأتون السحر وأنتم تبصرون
en: Their hearts toying as with trifles. The wrong-doers conceal their private counsels, (saying), "Is this (one) more than a man like yourselves? Will ye go to witchcraft with your eyes open?"

source: قال ربي يعلم القول في السماء والأرض وهو السميع العليم
en: Say: "My Lord knoweth (every) word (spoken) in the heavens and on earth: He is the One that heareth and knoweth (all things)."

source: بل قالوا أضغاث أحلام بل افتراه بل هو شاعر فليأتنا بآية كما أرسل الأولون
en: "Nay," they say, "(these are) medleys of dream! - Nay, He forged it! - Nay, He is (but) a poet! Let him then bring us a Sign like the ones that were sent to (Prophets) of old!"

source: ما آمنت قبلهم من قرية أهلكناها أفهم يؤمنون
en: (As to those) before them, not one of the populations which We destroyed believed: will these believe?

source: وما أرسلنا قبلك إلا رجالا نوحي إليهم فاسألوا أهل الذكر إن كنتم لا تعلمون
en: Before thee, also, the messengers We sent were but men, to whom We granted inspiration: If ye realise this not, ask of those who possess the Message.

source: وما جعلناهم جسدا لا يأكلون الطعام وما كانوا خالدين
en: Nor did We give them bodies that ate no food, nor were they exempt from death.

source: ثم صدقناهم الوعد فأنجيناهم ومن نشاء وأهلكنا المسرفين
en: In the end We fulfilled to them Our Promise, and We saved them and those whom We pleased, but We destroyed those who transgressed beyond bounds.

source: لقد أنزلنا إليكم كتابا فيه ذكركم أفلا تعقلون
en: We have revealed for you (O men!) a book in which is a Message for you: will ye not then understand?

source: وكم قصمنا من قرية كانت ظالمة وأنشأنا بعدها قوما آخرين
en: How many were the populations We utterly destroyed because of their iniquities, setting up in their places other peoples?

source: فلما أحسوا بأسنا إذا هم منها يركضون
en: Yet, when they felt Our Punishment (coming), behold, they (tried to) flee from it.

source: لا تركضوا وارجعوا إلى ما أترفتم فيه ومساكنكم لعلكم تسألون
en: Flee not, but return to the good things of this life which were given you, and to your homes in order that ye may be called to account.

source: قالوا يا ويلنا إنا كنا ظالمين
en: They said: "Ah! woe to us! We were indeed wrong-doers!"

source: فما زالت تلك دعواهم حتى جعلناهم حصيدا خامدين
en: And that cry of theirs ceased not, till We made them as a field that is mown, as ashes silent and quenched.

source: وما خلقنا السماء والأرض وما بينهما لاعبين
en: Not for (idle) sport did We create the heavens and the earth and all that is between!

source: لو أردنا أن نتخذ لهوا لاتخذناه من لدنا إن كنا فاعلين
en: If it had been Our wish to take (just) a pastime, We should surely have taken it from the things nearest to Us, if We would do (such a thing)!

source: بل نقذف بالحق على الباطل فيدمغه فإذا هو زاهق ولكم الويل مما تصفون
en: Nay, We hurl the Truth against falsehood, and it knocks out its brain, and behold, falsehood doth perish! Ah! woe be to you for the (false) things ye ascribe (to Us).

source: وله من في السماوات والأرض ومن عنده لا يستكبرون عن عبادته ولا يستحسرون
en: To Him belong all (creatures) in the heavens and on earth: Even those who are in His (very) Presence are not too proud to serve Him, nor are they (ever) weary (of His service):

source: يسبحون الليل والنهار لا يفترون
en: They celebrate His praises night and day, nor do they ever flag or intermit.

source: أم اتخذوا آلهة من الأرض هم ينشرون
en: Or have they taken (for worship) gods from the earth who can raise (the dead)?

source: لو كان فيهما آلهة إلا الله لفسدتا فسبحان الله رب العرش عما يصفون
en: If there were, in the heavens and the earth, other gods besides Allah, there would have been confusion in both! but glory to Allah, the Lord of the Throne: (High is He) above what they attribute to Him!

source: لا يسأل عما يفعل وهم يسألون
en: He cannot be questioned for His acts, but they will be questioned (for theirs).

source: أم اتخذوا من دونه آلهة قل هاتوا برهانكم هذا ذكر من معي وذكر من قبلي بل أكثرهم لا يعلمون الحق فهم معرضون
en: Or have they taken for worship (other) gods besides him? Say, "Bring your convincing proof: this is the Message of those with me and the Message of those before me." But most of them know not the Truth, and so turn away.

source: وما أرسلنا من قبلك من رسول إلا نوحي إليه أنه لا إله إلا أنا فاعبدون
en: Not a messenger did We send before thee without this inspiration sent by Us to him: that there is no god but I; therefore worship and serve Me.

source: وقالوا اتخذ الرحمن ولدا سبحانه بل عباد مكرمون
en: And they say: "(Allah) Most Gracious has begotten offspring." Glory to Him! they are (but) servants raised to honour.

source: لا يسبقونه بالقول وهم بأمره يعملون
en: They speak not before He speaks, and they act (in all things) by His Command.

source: يعلم ما بين أيديهم وما خلفهم ولا يشفعون إلا لمن ارتضى وهم من خشيته مشفقون
en: He knows what is before them, and what is behind them, and they offer no intercession except for those who are acceptable, and they stand in awe and reverence of His (Glory).

source: ومن يقل منهم إني إله من دونه فذلك نجزيه جهنم كذلك نجزي الظالمين
en: If any of them should say, "I am a god besides Him", such a one We should reward with Hell: thus do We reward those who do wrong.

source: أولم ير الذين كفروا أن السماوات والأرض كانتا رتقا ففتقناهما وجعلنا من الماء كل شيء حي أفلا يؤمنون
en: Do not the Unbelievers see that the heavens and the earth were joined together (as one unit of creation), before we clove them asunder? We made from water every living thing. Will they not then believe?

source: وجعلنا في الأرض رواسي أن تميد بهم وجعلنا فيها فجاجا سبلا لعلهم يهتدون
en: And We have set on the earth mountains standing firm, lest it should shake with them, and We have made therein broad highways (between mountains) for them to pass through: that they may receive Guidance.

source: وجعلنا السماء سقفا محفوظا وهم عن آياتها معرضون
en: And We have made the heavens as a canopy well guarded: yet do they turn away from the Signs which these things (point to)!

source: وهو الذي خلق الليل والنهار والشمس والقمر كل في فلك يسبحون
en: It is He Who created the Night and the Day, and the sun and the moon: all (the celestial bodies) swim along, each in its rounded course.

source: وما جعلنا لبشر من قبلك الخلد أفإن مت فهم الخالدون
en: We granted not to any man before thee permanent life (here): if then thou shouldst die, would they live permanently?

source: كل نفس ذائقة الموت ونبلوكم بالشر والخير فتنة وإلينا ترجعون
en: Every soul shall have a taste of death: and We test you by evil and by good by way of trial. to Us must ye return.

source: وإذا رآك الذين كفروا إن يتخذونك إلا هزوا أهذا الذي يذكر آلهتكم وهم بذكر الرحمن هم كافرون
en: When the Unbelievers see thee, they treat thee not except with ridicule. "Is this," (they say), "the one who talks of your gods?" and they blaspheme at the mention of (Allah) Most Gracious!

source: خلق الإنسان من عجل سأريكم آياتي فلا تستعجلون
en: Man is a creature of haste: soon (enough) will I show you My Signs; then ye will not ask Me to hasten them!

source: لو يعلم الذين كفروا حين لا يكفون عن وجوههم النار ولا عن ظهورهم ولا هم ينصرون
en: If only the Unbelievers knew (the time) when they will not be able to ward off the fire from their faces, nor yet from their backs, and (when) no help can reach them!

source: بل تأتيهم بغتة فتبهتهم فلا يستطيعون ردها ولا هم ينظرون
en: Nay, it may come to them all of a sudden and confound them: no power will they have then to avert it, nor will they (then) get respite.

source: قل من يكلؤكم بالليل والنهار من الرحمن بل هم عن ذكر ربهم معرضون
en: Say: "Who can keep you safe by night and by day from (the Wrath of) (Allah) Most Gracious?" Yet they turn away from the mention of their Lord.

source: أم لهم آلهة تمنعهم من دوننا لا يستطيعون نصر أنفسهم ولا هم منا يصحبون
en: Or have they gods that can guard them from Us? They have no power to aid themselves, nor can they be defended from Us.

source: بل متعنا هؤلاء وآباءهم حتى طال عليهم العمر أفلا يرون أنا نأتي الأرض ننقصها من أطرافها أفهم الغالبون
en: Nay, We gave the good things of this life to these men and their fathers until the period grew long for them; See they not that We gradually reduce the land (in their control) from its outlying borders? Is it then they who will win?

source: قل إنما أنذركم بالوحي ولا يسمع الصم الدعاء إذا ما ينذرون
en: Say, "I do but warn you according to revelation": But the deaf will not hear the call, (even) when they are warned!

source: ولئن مستهم نفحة من عذاب ربك ليقولن يا ويلنا إنا كنا ظالمين
en: If but a breath of the Wrath of thy Lord do touch them, they will then say, "Woe to us! we did wrong indeed!"

source: ونضع الموازين القسط ليوم القيامة فلا تظلم نفس شيئا وإن كان مثقال حبة من خردل أتينا بها وكفى بنا حاسبين
en: We shall set up scales of justice for the Day of Judgment, so that not a soul will be dealt with unjustly in the least, and if there be (no more than) the weight of a mustard seed, We will bring it (to account): and enough are We to take account.

source: ولقد آتينا موسى وهارون الفرقان وضياء وذكرا للمتقين
en: In the past We granted to Moses and Aaron the criterion (for judgment), and a Light and a Message for those who would do right,-

source: الذين يخشون ربهم بالغيب وهم من الساعة مشفقون
en: Those who fear their Lord in their most secret thoughts, and who hold the Hour (of Judgment) in awe.

source: وهذا ذكر مبارك أنزلناه أفأنتم له منكرون
en: And this is a blessed Message which We have sent down: will ye then reject it?

source: ولقد آتينا إبراهيم رشده من قبل وكنا به عالمين
en: We bestowed aforetime on Abraham his rectitude of conduct, and well were We acquainted with him.

source: إذ قال لأبيه وقومه ما هذه التماثيل التي أنتم لها عاكفون
en: Behold! he said to his father and his people, "What are these images, to which ye are (so assiduously) devoted?"

source: قالوا وجدنا آباءنا لها عابدين
en: They said, "We found our fathers worshipping them."

source: قال لقد كنتم أنتم وآباؤكم في ضلال مبين
en: He said, "Indeed ye have been in manifest error - ye and your fathers."

source: قالوا أجئتنا بالحق أم أنت من اللاعبين
en: They said, "Have you brought us the Truth, or are you one of those who jest?"

source: قال بل ربكم رب السماوات والأرض الذي فطرهن وأنا على ذلكم من الشاهدين
en: He said, "Nay, your Lord is the Lord of the heavens and the earth, He Who created them (from nothing): and I am a witness to this (Truth).

source: وتالله لأكيدن أصنامكم بعد أن تولوا مدبرين
en: "And by Allah, I have a plan for your idols - after ye go away and turn your backs"..

source: فجعلهم جذاذا إلا كبيرا لهم لعلهم إليه يرجعون
en: So he broke them to pieces, (all) but the biggest of them, that they might turn (and address themselves) to it.

source: قالوا من فعل هذا بآلهتنا إنه لمن الظالمين
en: They said, "Who has done this to our gods? He must indeed be some man of impiety!"

source: قالوا سمعنا فتى يذكرهم يقال له إبراهيم
en: They said, "We heard a youth talk of them: He is called Abraham."

source: قالوا فأتوا به على أعين الناس لعلهم يشهدون
en: They said, "Then bring him before the eyes of the people, that they may bear witness."

source: قالوا أأنت فعلت هذا بآلهتنا يا إبراهيم
en: They said, "Art thou the one that did this with our gods, O Abraham?"

source: قال بل فعله كبيرهم هذا فاسألوهم إن كانوا ينطقون
en: He said: "Nay, this was done by - this is their biggest one! ask them, if they can speak intelligently!"

source: فرجعوا إلى أنفسهم فقالوا إنكم أنتم الظالمون
en: So they turned to themselves and said, "Surely ye are the ones in the wrong!"

source: ثم نكسوا على رءوسهم لقد علمت ما هؤلاء ينطقون
en: Then were they confounded with shame: (they said), "Thou knowest full well that these (idols) do not speak!"

source: قال أفتعبدون من دون الله ما لا ينفعكم شيئا ولا يضركم
en: (Abraham) said, "Do ye then worship, besides Allah, things that can neither be of any good to you nor do you harm?

source: أف لكم ولما تعبدون من دون الله أفلا تعقلون
en: "Fie upon you, and upon the things that ye worship besides Allah! Have ye no sense?"..

source: قالوا حرقوه وانصروا آلهتكم إن كنتم فاعلين
en: They said, "Burn him and protect your gods, If ye do (anything at all)!"

source: قلنا يا نار كوني بردا وسلاما على إبراهيم
en: We said, "O Fire! be thou cool, and (a means of) safety for Abraham!"

source: وأرادوا به كيدا فجعلناهم الأخسرين
en: Then they sought a stratagem against him: but We made them the ones that lost most!

source: ونجيناه ولوطا إلى الأرض التي باركنا فيها للعالمين
en: But We delivered him and (his nephew) Lut (and directed them) to the land which We have blessed for the nations.

source: ووهبنا له إسحاق ويعقوب نافلة وكلا جعلنا صالحين
en: And We bestowed on him Isaac and, as an additional gift, (a grandson), Jacob, and We made righteous men of every one (of them).

source: وجعلناهم أئمة يهدون بأمرنا وأوحينا إليهم فعل الخيرات وإقام الصلاة وإيتاء الزكاة وكانوا لنا عابدين
en: And We made them leaders, guiding (men) by Our Command, and We sent them inspiration to do good deeds, to establish regular prayers, and to practise regular charity; and they constantly served Us (and Us only).

source: ولوطا آتيناه حكما وعلما ونجيناه من القرية التي كانت تعمل الخبائث إنهم كانوا قوم سوء فاسقين
en: And to Lut, too, We gave Judgment and Knowledge, and We saved him from the town which practised abominations: truly they were a people given to Evil, a rebellious people.

source: وأدخلناه في رحمتنا إنه من الصالحين
en: And We admitted him to Our Mercy: for he was one of the Righteous.

source: ونوحا إذ نادى من قبل فاستجبنا له فنجيناه وأهله من الكرب العظيم
en: (Remember) Noah, when he cried (to Us) aforetime: We listened to his (prayer) and delivered him and his family from great distress.

source: ونصرناه من القوم الذين كذبوا بآياتنا إنهم كانوا قوم سوء فأغرقناهم أجمعين
en: We helped him against people who rejected Our Signs: truly they were a people given to Evil: so We drowned them (in the Flood) all together.

source: وداوود وسليمان إذ يحكمان في الحرث إذ نفشت فيه غنم القوم وكنا لحكمهم شاهدين
en: And remember David and Solomon, when they gave judgment in the matter of the field into which the sheep of certain people had strayed by night: We did witness their judgment.

source: ففهمناها سليمان وكلا آتينا حكما وعلما وسخرنا مع داوود الجبال يسبحن والطير وكنا فاعلين
en: To Solomon We inspired the (right) understanding of the matter: to each (of them) We gave Judgment and Knowledge; it was Our power that made the hills and the birds celebrate Our praises, with David: it was We Who did (all these things).

source: وعلمناه صنعة لبوس لكم لتحصنكم من بأسكم فهل أنتم شاكرون
en: It was We Who taught him the making of coats of mail for your benefit, to guard you from each other's violence: will ye then be grateful?
